/*Лабораторная работа 3.2.11 Необходимо протабулировать функцию 2-мя способами
(1-используя вручную записанные функции, 2-не используя)*/
#include <cmath>
#include <iostream>
#include <ctime> 
//собственная библиотека для высчитывания значения функции
#include "Functions.h"
#include <windows.h>

using namespace std;

//функция для проверки ввода количества точек табулирования
int CHECKING_FUNC1()
{
	int a;
	cin >> a;
	while (std::cin.fail() || fabs(a)<1 || a<0)
	{
		std::cin.clear();
		fflush(stdin);
		std::cin.ignore(32767, '\n');
		cout << "Please, write correct number\n";
		cin >> a;
	}
	return a;
}

//функция для проверки ввода значений границ отрезка и точности
double CHECKING_FUNC2()
{
	double a;
	cin >> a;
	while (std::cin.fail())
	{
		std::cin.clear();
		fflush(stdin);
		std::cin.ignore(32767, '\n');
		cout << "Please, write correct number\n";
		cin >> a;
	}
	return a;
}

int main()
{
	double a, b;	// границы отрезка
	double eps;		// точность вычислений
	int k;			// количество точек табулирования

	cout << "Hello, write the numbers of x" << endl;
	k = CHECKING_FUNC1();
	cout << "Write a:" << endl;
	a= CHECKING_FUNC2();
	cout << "Write b:" << endl;
	b= CHECKING_FUNC2();
	cout << "Write epsilant" << endl;
	eps= CHECKING_FUNC2();
	
	tabulator(func1, a, b, eps, k);
	tabulator(func2, a, b, eps, k);
	
	system("pause");
	return 0;
}
/*Hello, write the numbers of x
10
Write a:
0.1
Write b:
10
Write epsilant
0.0001
0.1 -0.000166667
1.09 -0.175021
2.08 -1.21647
3.07 -3.91136
4.06 -9.04658
5.05 -17.4093
6.04 -29.7863
7.03 -46.9648
8.02 -69.7315
9.01 -98.8736
Working time-0.004
0.1 -0.000166667
1.09 -0.175021
2.08 -1.21647
3.07 -3.91136
4.06 -9.04658
5.05 -17.4093
6.04 -29.7863
7.03 -46.9648
8.02 -69.7315
9.01 -98.8736
Working time-0.004

Hello, write the numbers of x
10
Write a:
-0.1
Write b:
-10
Write epsilant
0.00001
-0.1 0.000130952
-1.09 0.175062
-2.08 1.21646
-3.07 3.9113
-4.06 9.04658
-5.05 17.4093
-6.04 29.7863
-7.03 46.9648
-8.02 69.7316
-9.01 98.8737
Working time-0.004
-0.1 0.000130952
-1.09 0.175062
-2.08 1.21646
-3.07 3.9113
-4.06 9.04658
-5.05 17.4093
-6.04 29.7863
-7.03 46.9648
-8.02 69.7316
-9.01 98.8737
Working time-0.004

Hello, write the numbers of x
10
Write a:
-1
Write b:
1
Write epsilant
0.0001
-1 0.135148
-0.8 0.0691958
-0.6 0.0292857
-0.4 0.00867725
-0.2 0.00104762
-5.55112e-17 0
0.2 -0.00104762
0.4 -0.00867725
0.6 -0.0292857
0.8 -0.0691958
1 -0.135148
Working time-0.01
-1 0.135148
-0.8 0.0691958
-0.6 0.0292857
-0.4 0.00867725
-0.2 0.00104762
-5.55112e-17 0
0.2 -0.00104762
0.4 -0.00867725
0.6 -0.0292857
0.8 -0.0691958
1 -0.135148
Working time-0.005

Hello, write the numbers of x
20
Write a:
0.1
Write b:
1.0
Write epsilant
0.00001
0.1 -0.000130952
0.145 -0.000413339
0.19 -0.000929957
0.235 -0.00175957
0.28 -0.0029763
0.325 -0.00463938
0.37 -0.00684565
0.415 -0.00965948
0.46 -0.0131548
0.505 -0.0174054
0.55 -0.0224852
0.595 -0.0284682
0.64 -0.0354282
0.685 -0.0434494
0.73 -0.0525873
0.775 -0.0629242
0.82 -0.0745339
0.865 -0.0874905
0.91 -0.101868
0.955 -0.11774
Working time-0.01
0.1 -0.000130952
0.145 -0.000413339
0.19 -0.000929957
0.235 -0.00175957
0.28 -0.0029763
0.325 -0.00463938
0.37 -0.00684565
0.415 -0.00965948
0.46 -0.0131548
0.505 -0.0174054
0.55 -0.0224852
0.595 -0.0284682
0.64 -0.0354282
0.685 -0.0434494
0.73 -0.0525873
0.775 -0.0629242
0.82 -0.0745339
0.865 -0.0874905
0.91 -0.101868
0.955 -0.11774
Working time-0.02


*/